validation/hyqmom/jetCrossing/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

w       0.1;
W       1.0;
x1      0.1;
x2      0.9;
h       1.0;
depth   0.1;

cellSize    0.05;

nwPts       #calc "round($w/$cellSize)";
nWPts       #calc "round(($W - 2*$w)/$cellSize)";

nhPts       #calc "round($h/$cellSize)";
nDepthPts   1;//#calc "round($depth/$cellSize)";

vertices
(
    (   0    0      0       )   //0
    (   $x1  0      0       )   //1
    (   $x2  0      0       )   //2
    (   $W   0      0       )   //3
    (   $W   $h     0       )   //4
    (   $x2  $h     0       )   //5
    (   $x1  $h     0       )   //6
    (   0    $h     0       )   //7
    (   0    0      $depth  )   //8
    (   $x1  0      $depth  )   //9
    (   $x2  0      $depth  )   //10
    (   $W   0      $depth  )   //11
    (   $W   $h     $depth  )   //12
    (   $x2  $h     $depth  )   //13
    (   $x1  $h     $depth  )   //14
    (   0    $h     $depth  )   //15
);

blocks
(
    hex (0 1 6 7 8 9 14 15) ($nwPts $nhPts $nDepthPts) simpleGrading (1 1 1)
    hex (1 2 5 6 9 10 13 14) ($nWPts $nhPts $nDepthPts) simpleGrading (1 1 1)
    hex (2 3 4 5 10 11 12 13) ($nwPts $nhPts $nDepthPts) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet1
    {
        type            patch;
        faces
        (
            (0 1 9 8)
        );
    }
    inlet2
    {
        type            patch;
        faces
        (
            (2 3 11 10)
        );
    }
    outlet
    {
        type            patch;
        faces
        (
            (6 7 15 14)
            (5 6 14 13)
            (4 5 13 12)

            (0 7 15 8)
            (3 4 12 11)
            (1 2 10 9)
        );
    }
//     walls
//     {
//         type            wall;
//         faces
//         (
//             (0 7 15 8)
//             (3 4 12 11)
//             (1 2 10 9)
//
// //             (0 1 6 7)
// //             (1 2 5 6)
// //             (2 3 4 5)
// //             (8 9 14 15)
// //             (9 10 13 14)
// //             (10 11 12 13)
//         );
//     }
);

mergePatchPairs
(
);

// ************************************************************************* //)))))
