validation/hyqmom/jetCrossing/0.org/U.232
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.232;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet1
    {
        type                fixedValue;
        value               uniform (0 0 0);
    }
    inlet2
    {
        type                fixedValue;
        value               uniform (0 0 0);
    }
    outlet
    {
        type                zeroGradient;
    }
    walls
    {
        type                zeroGradient;
//         value               uniform (0 0 0);
    }
    defaultFaces
    {
        type                empty;
    }
}

// ************************************************************************* //
